dlgreenwald/ESPHome-Bird-Detector/components/esp32_SD_FileManager/esp32_sd_filemanager.cpp
#include "esp32_sd_filemanager.h"

//#include <Arduino.h>
//#include <sys/stat.h>

//#include "esphome/core/application.h"
//#include "esphome/core/hal.h"
//#include "esphome/core/helpers.h"
#include "esphome/core/log.h"
//#include "esphome/core/util.h"

//#include <cstdlib>
#include <esp_http_server.h>
//#include <utility>

//#include <FS.h>
//#include <SD.h>
#include <SD_MMC.h>
#include "esphome/components/esp32_sdmmc/esp32_sdmmc.h"
#include <sys/param.h>
#include "upload_script.h"
#include "favicon.h"

namespace esphome {
namespace esp32_sd_filemanager {

static const char *TAG = "esp32_sd_filemanager";

ESP32SDFM::ESP32SDFM() {}

ESP32SDFM::~ESP32SDFM() {}

void ESP32SDFM::setup() {
  if (!esphome::esp32_sdmmc::global_ESP32SDMMC || esphome::esp32_sdmmc::global_ESP32SDMMC->is_failed()) {
    this->mark_failed();
    return;
  }

  start_file_server("");
}

float ESP32SDFM::get_setup_priority() const { return setup_priority::LATE; }

void ESP32SDFM::loop() {

}

void ESP32SDFM::dump_config() {
    ESP_LOGCONFIG(TAG, "SD File Manager");
    ESP_LOGCONFIG(TAG, "  Port: %d", this->port_);
    if (this->is_failed()) {
        ESP_LOGE(TAG, "  Setup Failed");
    }
}

/* Handler to redirect incoming GET request for /index.html to /
 * This can be overridden by uploading file with same name */
esp_err_t ESP32SDFM::index_html_get_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "307 Temporary Redirect");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_send(req, NULL, 0);  // Response body can be empty
    return ESP_OK;
}

/* Handler to respond with an icon file embedded in flash.
 * Browsers expect to GET website icon at URI /favicon.ico.
 * This can be overridden by uploading file with same name */
esp_err_t ESP32SDFM::favicon_get_handler(httpd_req_t *req)
{

    httpd_resp_set_type(req, "image/x-icon");
    httpd_resp_send(req, favicon,  8518);
    return ESP_OK;
}

/* Send HTTP response with a run-time generated html consisting of
 * a list of all files and folders under the requested path.
 * In case of SPIFFS this returns empty list when path is any
 * string other than '/', since SPIFFS doesn't support directories */
esp_err_t ESP32SDFM::http_resp_dir_html(httpd_req_t *req, const char *dirpath)
{
    char entrypath[FILE_PATH_MAX];
    char entrysize[16];
    const char *entrytype;

    esphome::esp32_sdmmc::global_ESP32SDMMC->get_sd_lock(TAG);

    ESP_LOGI(TAG, "Listing Directory: %s", dirpath);
    File dir = SD_MMC.open(dirpath);
    const size_t dirpath_len = strlen(dirpath);

    /* Retrieve the base path of file storage to construct the full path */
    strlcpy(entrypath, dirpath, sizeof(entrypath));

    if (!dir) {
        ESP_LOGE(TAG, "Failed to stat dir : %s", dirpath);
        /* Respond with 404 Not Found */
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Directory does not exist");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    /* Send HTML file header */
    httpd_resp_sendstr_chunk(req, "<!DOCTYPE html><html><body>");

    // /* Get handle to embedded file upload script */

    // /* Add file upload form and script which on execution sends a POST request to /upload */
   httpd_resp_send_chunk(req, uploadScript, strlen(uploadScript));

    /* Send file-list table definition and column labels */
    httpd_resp_sendstr_chunk(req,
        "<table class=\"fixed\" border=\"1\">"
        "<col width=\"800px\" /><col width=\"300px\" /><col width=\"300px\" /><col width=\"100px\" />"
        "<thead><tr><th>Name</th><th>Type</th><th>Size (Bytes)</th><th>Delete</th></tr></thead>"
        "<tbody>");

    /* Iterate over all files / folders and fetch their names and sizes */
    File file = dir.openNextFile();
    while (file) {
        entrytype = (file.isDirectory() ? "directory" : "file");

        strlcpy(entrypath + dirpath_len, file.name(), sizeof(entrypath) - dirpath_len);
        // if (stat(entrypath, &entry_stat) == -1) {
        //     ESP_LOGE(TAG, "Failed to stat %s : %s", entrytype, entry->d_name);
        //     continue;
        // }
        sprintf(entrysize, "%ld", file.size());
        ESP_LOGV(TAG, "Found %s : %s (%s bytes)", entrytype, file.name(), entrysize);

        /* Send chunk of HTML file containing table entries with file name and size */
        httpd_resp_sendstr_chunk(req, "<tr><td><a href=\"");
        httpd_resp_sendstr_chunk(req, req->uri);
        httpd_resp_sendstr_chunk(req, file.name());
        if (file.isDirectory()) {
            httpd_resp_sendstr_chunk(req, "/");
        }
        httpd_resp_sendstr_chunk(req, "\">");
        httpd_resp_sendstr_chunk(req, file.name());
        httpd_resp_sendstr_chunk(req, "</a></td><td>");
        httpd_resp_sendstr_chunk(req, entrytype);
        httpd_resp_sendstr_chunk(req, "</td><td>");
        httpd_resp_sendstr_chunk(req, entrysize);
        httpd_resp_sendstr_chunk(req, "</td><td>");
        httpd_resp_sendstr_chunk(req, "<form method=\"post\" action=\"/delete");
        httpd_resp_sendstr_chunk(req, req->uri);
        httpd_resp_sendstr_chunk(req, file.name());
        httpd_resp_sendstr_chunk(req, "\"><button type=\"submit\">Delete</button></form>");
        httpd_resp_sendstr_chunk(req, "</td></tr>\n");

        file = dir.openNextFile();
    }
    dir.close();

    esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);

    /* Finish the file list table */
    httpd_resp_sendstr_chunk(req, "</tbody></table>");

    /* Send remaining chunk of HTML file to complete it */
    httpd_resp_sendstr_chunk(req, "</body></html>");

    /* Send empty chunk to signal HTTP response completion */
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}

#define IS_FILE_EXT(filename, ext) \
    (strcasecmp(&filename[strlen(filename) - sizeof(ext) + 1], ext) == 0)

/* Set HTTP response content type according to file extension */
esp_err_t ESP32SDFM::set_content_type_from_file(httpd_req_t *req, const char *filename)
{
    if (IS_FILE_EXT(filename, ".htm") || IS_FILE_EXT(filename, ".html")) {
      return httpd_resp_set_type(req, "text/html");
    } else if (IS_FILE_EXT(filename, ".css")) {
      return httpd_resp_set_type(req, "text/css");
    } else if (IS_FILE_EXT(filename, ".js")) {
      return httpd_resp_set_type(req, "application/javascript");
    } else if (IS_FILE_EXT(filename, ".png")) {
      return httpd_resp_set_type(req, "image/png");
    } else if (IS_FILE_EXT(filename, ".gif")) {
      return httpd_resp_set_type(req, "image/gif");
    } else if (IS_FILE_EXT(filename, ".jpg") || IS_FILE_EXT(filename, ".jpeg")) {
      return httpd_resp_set_type(req, "image/jpeg");
    } else if (IS_FILE_EXT(filename, ".ico")) {
      return httpd_resp_set_type(req, "image/x-icon");
    } else if (IS_FILE_EXT(filename, ".xml")) {
      return httpd_resp_set_type(req, "text/xml");
    } else if (IS_FILE_EXT(filename, ".pdf")) {
      return httpd_resp_set_type(req, "application/pdf");
    } else if (IS_FILE_EXT(filename, ".zip")) {
      return httpd_resp_set_type(req, "application/zip");
    } else if (IS_FILE_EXT(filename, ".ico")) {
      return httpd_resp_set_type(req, "image/x-icon");
    }

    /* This is a limited set only */
    /* For any other type always set as plain text */
    return httpd_resp_set_type(req, "text/plain");
}

/* Copies the full path into destination buffer and returns
 * pointer to path (skipping the preceding base path) */
const char* ESP32SDFM::get_path_from_uri(char *dest, const char *base_path, const char *uri, size_t destsize)
{
    const size_t base_pathlen = strlen(base_path);
    size_t pathlen = strlen(uri);

    const char *quest = strchr(uri, '?');
    if (quest) {
        pathlen = MIN(pathlen, quest - uri);
    }
    const char *hash = strchr(uri, '#');
    if (hash) {
        pathlen = MIN(pathlen, hash - uri);
    }

    if (base_pathlen + pathlen + 1 > destsize) {
        /* Full path string won't fit into destination buffer */
        return NULL;
    }

    /* Construct full path (base + path) */
    strcpy(dest, base_path);
    strlcpy(dest + base_pathlen, uri, pathlen + 1);

    /* Return pointer to path, skipping the base */
    return dest + base_pathlen;
}

/* Handler to download a file kept on the server */
esp_err_t ESP32SDFM::download_get_handler(httpd_req *req)
{
    char filepath[FILE_PATH_MAX];

    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *)req->user_ctx)->base_path,
                                             req->uri, sizeof(filepath));
    if (!filename) {
        ESP_LOGE(TAG, "Filename is too long");
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    /* If name has trailing '/', respond with directory contents */
    if (filename[strlen(filename) - 1] == '/') {
        //drop the trailing '/' from the filepath as it's problematic for open if it's more than the root.
        if(strlen(filepath)>1){
            filepath[strlen(filepath)-1] = '\0';
        }
        return http_resp_dir_html(req, filepath);
    }


    esphome::esp32_sdmmc::global_ESP32SDMMC->get_sd_lock(TAG);

    if (!SD_MMC.exists(filename)) {
        /* If file not present on SPIFFS check if URI
         * corresponds to one of the hardcoded paths */
        if (strcmp(filename, "/index.html") == 0) {
            esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
            return index_html_get_handler(req);
        } 
        else if (strcmp(filename, "/favicon.ico") == 0) {
            esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
            return favicon_get_handler(req);
        }
        ESP_LOGE(TAG, "Failed to stat file : %s", filepath);
        /* Respond with 404 Not Found */
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "File does not exist");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    File fd = SD_MMC.open(filepath);
    if (!fd) {
        ESP_LOGE(TAG, "Failed to read existing file : %s", filepath);
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to read existing file");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Sending file : %s (%ld bytes)...", filename, fd.size());
    set_content_type_from_file(req, filename);

    /* Retrieve the pointer to scratch buffer for temporary storage */
    uint8_t *chunk = ((struct file_server_data *)req->user_ctx)->scratch;
    size_t chunksize;
    do {
        /* Read file in chunks into the scratch buffer */
        chunksize = fd.read(chunk, SCRATCH_BUFSIZE);

        if (chunksize > 0) {
            /* Send the buffer contents as HTTP response chunk */
            if (httpd_resp_send_chunk(req, (char*)chunk, chunksize) != ESP_OK) {
                fd.close();
                ESP_LOGE(TAG, "File sending failed!");
                /* Abort sending file */
                httpd_resp_sendstr_chunk(req, NULL);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to send file");
                esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
               return ESP_FAIL;
           }
        }

        /* Keep looping till the whole file is sent */
    } while (chunksize != 0);

    /* Close file after sending complete */
    fd.close();
    ESP_LOGI(TAG, "File sending complete");

    esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);

    /* Respond with an empty chunk to signal HTTP response completion */
#ifdef CONFIG_EXAMPLE_HTTPD_CONN_CLOSE_HEADER
    httpd_resp_set_hdr(req, "Connection", "close");
#endif
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

/* Handler to upload a file onto the server */
esp_err_t ESP32SDFM::upload_post_handler(httpd_req_t *req)
{
    char filepath[FILE_PATH_MAX];

    /* Skip leading "/upload" from URI to get filename */
    /* Note sizeof() counts NULL termination hence the -1 */
    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *)req->user_ctx)->base_path,
                                             req->uri + sizeof("/upload") - 1, sizeof(filepath));
    if (!filename) {
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    /* Filename cannot have a trailing '/' */
    if (filename[strlen(filename) - 1] == '/') {
        ESP_LOGE(TAG, "Invalid filename : %s", filename);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid filename");
        return ESP_FAIL;
    }

    esphome::esp32_sdmmc::global_ESP32SDMMC->get_sd_lock(TAG);

    if (SD_MMC.exists(filepath)) {
        ESP_LOGE(TAG, "File already exists : %s", filepath);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File already exists");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    /* File cannot be larger than a limit */
    if (req->content_len > MAX_FILE_SIZE) {
        ESP_LOGE(TAG, "File too large : %d bytes", req->content_len);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST,
                            "File size must be less than "
                            MAX_FILE_SIZE_STR "!");
        /* Return failure to close underlying connection else the
         * incoming file content will keep the socket busy */
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    File file = SD_MMC.open(filepath, FILE_WRITE);
    if (!file) {
        ESP_LOGE(TAG, "Failed to create file : %s", filepath);
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to create file");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Receiving file : %s...", filename);

    /* Retrieve the pointer to scratch buffer for temporary storage */
    uint8_t *chunk = ((struct file_server_data *)req->user_ctx)->scratch;
    int received;

    /* Content length of the request gives
     * the size of the file being uploaded */
    int remaining = req->content_len;

    while (remaining > 0) {

        ESP_LOGI(TAG, "Remaining size : %d", remaining);
        /* Receive the file part by part into a buffer */
        if ((received = httpd_req_recv(req, (char*)chunk, MIN(remaining, SCRATCH_BUFSIZE))) <= 0) {
            if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                /* Retry if timeout occurred */
                continue;
            }

            /* In case of unrecoverable error,
             * close and delete the unfinished file*/
            file.close();
            SD_MMC.remove(filepath);

            ESP_LOGE(TAG, "File reception failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
            esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
            return ESP_FAIL;
        }

        /* Write buffer content to file on storage */
        
        if (received && (received != file.write(chunk, received))) {
            /* Couldn't write everything to file!
             * Storage may be full? */
            file.close();
            SD_MMC.remove(filepath);

            ESP_LOGE(TAG, "File write failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to write file to storage");
            esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
            return ESP_FAIL;
        }

        /* Keep track of remaining size of
         * the file left to be uploaded */
        remaining -= received;
    }

    /* Close file upon upload completion */
    file.close();
    ESP_LOGI(TAG, "File reception complete");

    esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);

    /* Redirect onto root to see the updated file list */
    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
#ifdef CONFIG_EXAMPLE_HTTPD_CONN_CLOSE_HEADER
    httpd_resp_set_hdr(req, "Connection", "close");
#endif
    httpd_resp_sendstr(req, "File uploaded successfully");
    return ESP_OK;
}

/* Handler to delete a file from the server */
esp_err_t ESP32SDFM::delete_post_handler(httpd_req *req)
{
    char filepath[FILE_PATH_MAX];
   
    /* Skip leading "/delete" from URI to get filename */
    /* Note sizeof() counts NULL termination hence the -1 */
    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *)req->user_ctx)->base_path,
                                             req->uri  + sizeof("/delete") - 1, sizeof(filepath));
    if (!filename) {
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    /* Filename cannot have a trailing '/' */
    if (filename[strlen(filename) - 1] == '/') {
        ESP_LOGE(TAG, "Invalid filename : %s", filename);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid filename");
        return ESP_FAIL;
    }

    esphome::esp32_sdmmc::global_ESP32SDMMC->get_sd_lock(TAG);

    if (!SD_MMC.exists(filename)) {
        ESP_LOGE(TAG, "File does not exist : %s", filename);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File does not exist");
        esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Deleting file : %s", filename);
    /* Delete file */
    SD_MMC.remove(filename);

    esphome::esp32_sdmmc::global_ESP32SDMMC->return_sd_lock(TAG);
    /* Redirect onto root to see the updated file list */
    httpd_resp_set_status(req, "303 See Other");

    char *lastSlashPtr = strrchr(filepath, '/');
    char *parent = strndup(filepath, ((size_t)lastSlashPtr) - ((size_t)&filepath)+1);

    httpd_resp_set_hdr(req, "Location", parent);
#ifdef CONFIG_EXAMPLE_HTTPD_CONN_CLOSE_HEADER
    httpd_resp_set_hdr(req, "Connection", "close");
#endif
    httpd_resp_sendstr(req, "File deleted successfully");
    return ESP_OK;
}

/* Function to start the file server */
esp_err_t ESP32SDFM::start_file_server(const char *base_path)
{
    static struct file_server_data *server_data = NULL;

    if (server_data) {
        ESP_LOGE(TAG, "File server already started");
        return ESP_ERR_INVALID_STATE;
    }

    /* Allocate memory for server data */
    server_data = (struct file_server_data *)calloc(1, sizeof(struct file_server_data));
    if (!server_data) {
        ESP_LOGE(TAG, "Failed to allocate memory for server data");
        return ESP_ERR_NO_MEM;
    }
    strlcpy(server_data->base_path, base_path,
            sizeof(server_data->base_path));

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    /* Use the URI wildcard matching function in order to
     * allow the same handler to respond to multiple different
     * target URIs which match the wildcard scheme */
    config.uri_match_fn = httpd_uri_match_wildcard;
    config.server_port = port_,

    ESP_LOGI(TAG, "Starting HTTP Server on port: '%d'", port_);
    if (httpd_start(&server, &config) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start file server!");
        return ESP_FAIL;
    }

    /* URI handler for getting uploaded files */
    httpd_uri_t file_download = {
        .uri       = "/*",  // Match all URIs of type /path/to/file
        .method    = HTTP_GET,
        .handler   = download_get_handler,
        .user_ctx  = server_data    // Pass server data as context
    };
    httpd_register_uri_handler(server, &file_download);

    /* URI handler for uploading files to server */
    httpd_uri_t file_upload = {
        .uri       = "/upload/*",   // Match all URIs of type /upload/path/to/file
        .method    = HTTP_POST,
        .handler   = upload_post_handler,
        .user_ctx  = server_data    // Pass server data as context
    };
    httpd_register_uri_handler(server, &file_upload);

    /* URI handler for deleting files from server */
    httpd_uri_t file_delete = {
        .uri       = "/delete/*",   // Match all URIs of type /delete/path/to/file
        .method    = HTTP_POST,
        .handler   = delete_post_handler,
        .user_ctx  = server_data    // Pass server data as context
    };
    httpd_register_uri_handler(server, &file_delete);

    return ESP_OK;
}

} //namespace esp32_sd_filemanager
} //namespace esphome